export let typeColor =
  new Map([
    [

      "饮食", "#4f84db"
    ],
    [

      "房租", "#12c112"
    ],
    [

      "交通", "#9dc3ff"
    ],
    [

      "娱乐", "#ffb4ff"
    ],
    [

      "游戏", "#00ffc4"
    ],
    [

      "生活用品", "#f18f3c"
    ],
    [

      "超市", "#f45252"
    ],
    [

      "日常消费", "#e6c662"
    ],
    [

      "衣物", "#45C2E0"
    ],
    [

      "网费-话费", "#A3D400"
    ],
    [

      "水电气", "#C1EBDD"
    ],
    [

      "药品", "#FFC851"
    ],
    [

      "花呗", "#1869A0"
    ],
    [

      "电子设备", "#f2b7b7"
    ],
    [

      "红包", "#649b4b"
    ],
    [

      "会员", "#9F79EE"
    ]
  ])